# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'warrensbox/tap'
# For github cli auth https://docs.github.com/en/get-started/getting-started-with-git/caching-your-github-credentials-in-git
tap 'microsoft/git'
brew 'gh'
# Java via Eclipse Adoptium
tap 'homebrew/cask-versions'
# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# eksctl
tap 'weaveworks/tap'
brew 'weaveworks/tap/eksctl'

# Leapp
cask 'leapp'

# Install GNU core utilities (those that come with OS X are outdated)
# See https://github.com/kubernetes/community/blob/master/contributors/devel/development.md#setting-up-macos
brew 'coreutils'
brew 'ed'
brew 'gawk'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'grep'
brew 'make'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# DevUtils
cask 'devutils'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'trash'
brew 'wget'
brew 'pyenv'
brew 'jq'
brew 'yq'

brew 'go'
# https://github.com/sachaos/viddy
brew 'viddy'
# Vault
brew 'vault'
# for code signing
brew 'gnupg'
brew 'pinentry-mac'
# Cli commands
brew 'ahoy'
## Kubernetes
brew 'kubectx'
brew 'kube-ps1'
brew 'kops'
brew 'kind'
brew 'minikube'
brew 'helm'
brew 'kustomize'
brew 'argocd'

tap 'derailed/k9s'
brew 'derailed/k9s/k9s'

brew 'operator-sdk'
# calculate lines of code
brew 'cloc'
# for git diff
brew 'git-delta'
## Github Actions
brew 'act'
brew 'cmake'
brew 'pre-commit'
brew 'markdownlint-cli'
## Java
brew 'jenv'
brew 'sbt'
cask 'temurin8'
cask 'temurin11'
# postgresql
brew 'postgresql@12'
# Project Management
cask 'ganttproject'

## Heroku
tap 'heroku/brew'
brew 'heroku'

## For backstage
# -- this has problems with better-sqlite installation dependency libtool
# brew 'nvm'
brew 'yarn'

## CircleCi
brew 'circleci'

## ProtoBuf
brew 'protobuf'

# Apps
cask 'iterm2'
cask 'rectangle'
cask 'flux'
cask 'raycast'
cask '1password'
cask '1password-cli'
# map right_cmd button to escape
# map capslock button to left_ctrl
cask 'karabiner-elements'
# fonts
cask 'font-meslo-lg-nerd-font'
cask 'font-fira-code'
cask 'git-credential-manager-core'
# cask 'mactex'
cask 'tomighty'
cask 'docker'

# Visual Studio Code (VSCode)
cask 'visual-studio-code'

## Pai Apps
# VPN client
cask 'pritunl'
# k8s visualization
cask 'lens'
# Pai Binaries
brew 'warrensbox/tap/tfswitch'
brew 'terragrunt'

# Compression
brew 'snappy'

### Experimental

#### https://github.com/charmbracelet/vhs
tap 'charmbracelet/tap'
brew 'vhs'
brew 'ffmpeg'
brew 'ttyd'

### Google Oauth recertification
cask 'owasp-zap'
cask 'firefox'

### Dependency Management Security
# https://github.com/anchore/grype
tap 'anchore/grype'
brew 'grype'
# https://github.com/anchore/syft
tap 'anchore/syft'
brew 'syft'
# https://github.com/ossf/scorecard#what-is-scorecards
brew 'scorecard'

cask 'discord'

### Rust cli productivity tools
brew 'zoxide'
brew 'fzf'
brew 'ripgrep'

### Backstage.io
brew 'pkg-config'
brew 'cairo'
brew 'pango'
brew 'libpng'
brew 'jpeg'
brew 'giflib'
brew 'librsvg'
brew 'adr-tools'
